package com.example.navermapex_2;

import com.naver.maps.geometry.LatLng;

import java.util.ArrayList;

public class Chip_RestroomList {
    private ArrayList<LatLng> list = new ArrayList<>();
    private Boolean check;

    public Chip_RestroomList() {
        this.check = false;
        list.add(new LatLng(35.83685735886198, 128.7545924428146));//정문 대구은행
        list.add(new LatLng(35.83651397060139, 128.75646778964966));//박물관
        list.add(new LatLng(35.83550827772912, 128.75633529441535));//학생지원
        list.add(new LatLng(35.8342579866046, 128.75546845718878));//노천강당
        list.add(new LatLng(35.83437600263862, 128.75604766479086));//이건희
        list.add(new LatLng(35.83506935519952, 128.7573960765435));//디자인관
        list.add(new LatLng(35.83482867712222, 128.7584893819586));//미술관
        list.add(new LatLng(35.83440161690518, 128.75854651526822));//사범대
        list.add(new LatLng(35.83429543964252, 128.7565245168085));//학생회관
        list.add(new LatLng(35.83350571838494, 128.7566692521698));//정치행정
        list.add(new LatLng(35.83300703162817, 128.75848932984286));//중도
        list.add(new LatLng(35.83283868825299, 128.75540906177542));//상경관
        list.add(new LatLng(35.83157307221238, 128.75818523461908));//인문관
        list.add(new LatLng(35.834759606204614,128.76121465136436));//음악대학
        list.add(new LatLng(35.8351592076029,128.7607636621708));//필승관
        list.add(new LatLng(35.833912245634494,128.7616177885422));//승리관
        list.add(new LatLng(35.8324343749854,128.76037694315028));//제2 인문관
        list.add(new LatLng(35.833088017009786,128.7624359406384));//학군단
        list.add(new LatLng(35.83214271725788,128.76194533767415));//연대본부, 출판부
        list.add(new LatLng(35.83165352562615,128.76030245901308));//외국어교육원
        list.add(new LatLng(35.830219382337006,128.76148634483496));//대학본부
        list.add(new LatLng(35.82996469067034,128.7620472229949));//학사민원실
        list.add(new LatLng(35.83232586560078,128.7531817695774));//천마아트
        list.add(new LatLng(35.830610332227536,128.75432172581196));//IT관
        list.add(new LatLng(35.82989406155791,128.7540841436376));//전기관
        list.add(new LatLng(35.829350220149024,128.75391428329078));//섬유관
        list.add(new LatLng(35.82888558937826,128.75392890709753));//화공관
        list.add(new LatLng(35.828487848748,128.75385611458182));//기계공작실습
        list.add(new LatLng(35.827093626087986,128.7538648162527));//소재관
        list.add(new LatLng(35.82660524101935,128.75391158425828));//기계관
        list.add(new LatLng(35.826308209144585,128.75392583124977));//기계본부
        list.add(new LatLng(35.82555021369778,128.75399443517165));//생산기술원
        list.add(new LatLng(35.82555171546507,128.7551184273131));//중앙기기센터본관
        list.add(new LatLng(35.82511133798863,128.75503783113322));//자동차공학
        list.add(new LatLng(35.82449693639629,128.75473837115015));//제2시험생산공장
        list.add(new LatLng(35.824423249573314,128.75548348404658));//유비테크
        list.add(new LatLng(35.82448528302123,128.7559188752594));//경북테크노파크
        list.add(new LatLng(35.82433294761013,128.7564150930491));//경북테크노파크2
        list.add(new LatLng(35.82497903916523,128.75618356852823));//제1시험생산공장
        list.add(new LatLng(35.82542915646195,128.75622594644074));//로봇관
        list.add(new LatLng(35.825526854607645,128.7570036795869));//산학협력단
        list.add(new LatLng(35.825985662455224,128.75600375571923));//창업보육센터
        list.add(new LatLng(35.826302005782324,128.75669450301928));//경상북도지원센터
        list.add(new LatLng(35.82982289907889,128.75522216113524));//건축연구원
        list.add(new LatLng(35.8293051727927,128.75517575119272));//정보통신연구소
        list.add(new LatLng(35.829388858758605,128.75561009889134));//정보전산원
        list.add(new LatLng(35.82892175072833,128.7552122773783));//건설관
        list.add(new LatLng(35.82846452431275,128.75654174588897));//자연계식당
        list.add(new LatLng(35.82887855317446,128.75713574097819));//이도
        list.add(new LatLng(35.82805818840173,128.7560058129455));//생과대
        list.add(new LatLng(35.827704716772814,128.75553688013008));//생과대실험동
        list.add(new LatLng(35.82768984468426,128.7567959357205));//생과대본관
        list.add(new LatLng(35.827289296830386,128.75662649428108));//생과대실험동2
        list.add(new LatLng(35.8278935299231,128.7583484342851));//약대
        list.add(new LatLng(35.82918862218935,128.75851318485599));//생과대본관
        list.add(new LatLng(35.82908615119291,128.75963005640205));//생과대별관
        list.add(new LatLng(35.828509947990696,128.75940383574783));//법학대학원
        list.add(new LatLng(35.82806829262516,128.76023746228992));//법학대
        list.add(new LatLng(35.83010319925738,128.7567843441119));//제1과학관 카페
        list.add(new LatLng(35.83015127667248,128.75766377686892));//제1과학관
        list.add(new LatLng(35.82960525343927,128.75686926101451));//제3과학관
        list.add(new LatLng(35.82949622371609,128.75754919353182));//제2과학관
        list.add(new LatLng(35.82949622371609,128.75754919353182));//이과대
        list.add(new LatLng(35.824516134157406,128.75742315821662));//SHB본사
    }
    public void setCheck(Boolean check) {
        this.check = check;
    }
    public Boolean getCheck() {
        return check;
    }
    public ArrayList<LatLng> getList() {
        return list;
    }
}
